rbs/macro-benchmarks/rails/substruct/app/controllers/admin/content_nodes_controller.rb

    def set_sections
      @sections = Section.find_ordered_parents
---
SELECT * FROM `sections` WHERE (parent_id IS NULL OR parent_id = 0) ORDER BY -rank DESC